**About Book Crossing Dataset**<br>

This dataset has been compiled by Cai-Nicolas Ziegler in 2004, and it comprises of three tables for users, books and ratings. Explicit ratings are expressed on a scale from 1-10 (higher values denoting higher appreciation) and implicit rating is expressed by 0.

Reference: http://www2.informatik.uni-freiburg.de/~cziegler/BX/

**Objective**

This project entails building a Book Recommender System for users based on user-based and item-based collaborative filtering approaches.

#### Execute the below cell to load the datasets

In [1]:
import pandas as pd
#Loading data
books = pd.read_csv("books.csv", sep=";", error_bad_lines=False, encoding="latin-1")
books.columns = ['ISBN', 'bookTitle', 'bookAuthor', 'yearOfPublication', 'publisher', 'imageUrlS', 'imageUrlM', 'imageUrlL']

users = pd.read_csv('users.csv', sep=';', error_bad_lines=False, encoding="latin-1")
users.columns = ['userID', 'Location', 'Age']

ratings = pd.read_csv('ratings.csv', sep=';', error_bad_lines=False, encoding="latin-1")
ratings.columns = ['userID', 'ISBN', 'bookRating']

b'Skipping line 6452: expected 8 fields, saw 9\nSkipping line 43667: expected 8 fields, saw 10\nSkipping line 51751: expected 8 fields, saw 9\n'
b'Skipping line 92038: expected 8 fields, saw 9\nSkipping line 104319: expected 8 fields, saw 9\nSkipping line 121768: expected 8 fields, saw 9\n'
b'Skipping line 144058: expected 8 fields, saw 9\nSkipping line 150789: expected 8 fields, saw 9\nSkipping line 157128: expected 8 fields, saw 9\nSkipping line 180189: expected 8 fields, saw 9\nSkipping line 185738: expected 8 fields, saw 9\n'
b'Skipping line 209388: expected 8 fields, saw 9\nSkipping line 220626: expected 8 fields, saw 9\nSkipping line 227933: expected 8 fields, saw 11\nSkipping line 228957: expected 8 fields, saw 10\nSkipping line 245933: expected 8 fields, saw 9\nSkipping line 251296: expected 8 fields, saw 9\nSkipping line 259941: expected 8 fields, saw 9\nSkipping line 261529: expected 8 fields, saw 9\n'
C:\Users\rachi\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2785: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

### Check no.of records and features given in each dataset

In [2]:
books.shape

(271360, 8)

In [3]:
books.describe().transpose()

,count,unique,top,freq
ISBN,271360,271360,0486264726,1
bookTitle,271360,242135,Selected Poems,27
bookAuthor,271359,102023,Agatha Christie,632
yearOfPublication,271360,202,2002,13903
publisher,271358,16807,Harlequin,7535
imageUrlS,271360,271044,http://images.amazon.com/images/P/044661260X.0...,2
imageUrlM,271360,271044,http://images.amazon.com/images/P/014062063X.0...,2
imageUrlL,271357,271041,http://images.amazon.com/images/P/039309426X.0...,2

In [4]:
users.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
userID,278858.0,139429.500000,80499.515020,1.0,69715.25,139429.5,209143.75,278858.0
Age,168096.0,34.751434,14.428097,0.0,24.00,32.0,44.00,244.0

In [5]:
ratings.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
userID,1149780.0,140386.395126,80562.277718,2.0,70345.0,141010.0,211028.0,278854.0
bookRating,1149780.0,2.866950,3.854184,0.0,0.0,0.0,7.0,10.0

## Exploring books dataset

In [6]:
books.head()

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher,imageUrlS,imageUrlM,imageUrlL
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

### Drop last three columns containing image URLs which will not be required for analysis

In [7]:
books.drop(columns=["imageUrlS","imageUrlM","imageUrlL"],axis=1,inplace=True)

In [8]:
books.head()

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company

**yearOfPublication**

### Check unique values of yearOfPublication

In [9]:
books["yearOfPublication"].unique()

array([2002, 2001, 1991, 1999, 2000, 1993, 1996, 1988, 2004, 1998, 1994,
       2003, 1997, 1983, 1979, 1995, 1982, 1985, 1992, 1986, 1978, 1980,
       1952, 1987, 1990, 1981, 1989, 1984, 0, 1968, 1961, 1958, 1974,
       1976, 1971, 1977, 1975, 1965, 1941, 1970, 1962, 1973, 1972, 1960,
       1966, 1920, 1956, 1959, 1953, 1951, 1942, 1963, 1964, 1969, 1954,
       1950, 1967, 2005, 1957, 1940, 1937, 1955, 1946, 1936, 1930, 2011,
       1925, 1948, 1943, 1947, 1945, 1923, 2020, 1939, 1926, 1938, 2030,
       1911, 1904, 1949, 1932, 1928, 1929, 1927, 1931, 1914, 2050, 1934,
       1910, 1933, 1902, 1924, 1921, 1900, 2038, 2026, 1944, 1917, 1901,
       2010, 1908, 1906, 1935, 1806, 2021, '2000', '1995', '1999', '2004',
       '2003', '1990', '1994', '1986', '1989', '2002', '1981', '1993',
       '1983', '1982', '1976', '1991', '1977', '1998', '1992', '1996',
       '0', '1997', '2001', '1974', '1968', '1987', '1984', '1988',
       '1963', '1956', '1970', '1985', '1978', '1973', '1980', '1979',
       '1975', '1969', '1961', '1965', '1939', '1958', '1950', '1953',
       '1966', '1971', '1959', '1972', '1955', '1957', '1945', '1960',
       '1967', '1932', '1924', '1964', '2012', '1911', '1927', '1948',
       '1962', '2006', '1952', '1940', '1951', '1931', '1954', '2005',
       '1930', '1941', '1944', 'DK Publishing Inc', '1943', '1938',
       '1900', '1942', '1923', '1920', '1933', 'Gallimard', '1909',
       '1946', '2008', '1378', '2030', '1936', '1947', '2011', '2020',
       '1919', '1949', '1922', '1897', '2024', '1376', '1926', '2037'],
      dtype=object)

As it can be seen from above that there are some incorrect entries in this field. It looks like Publisher names 'DK Publishing Inc' and 'Gallimard' have been incorrectly loaded as yearOfPublication in dataset due to some errors in csv file.


Also some of the entries are strings and same years have been entered as numbers in some places. We will try to fix these things in the coming questions.

### Check the rows having 'DK Publishing Inc' as yearOfPublication

In [10]:
books[books["yearOfPublication"]=="DK Publishing Inc"]

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher
209538,078946697X,"DK Readers: Creating the X-Men, How It All Beg...",2000,DK Publishing Inc,http://images.amazon.com/images/P/078946697X.0...
221678,0789466953,"DK Readers: Creating the X-Men, How Comic Book...",2000,DK Publishing Inc,http://images.amazon.com/images/P/0789466953.0...

### Drop the rows having `'DK Publishing Inc'` and `'Gallimard'` as `yearOfPublication`

In [11]:
#In this step I am only selecting the rows which are not containing DK publishing and Gallimard as the year of publication
books=books[(books["yearOfPublication"]!="DK Publishing Inc")&(books["yearOfPublication"]!="Gallimard")]

In [12]:
books["yearOfPublication"].unique()

array([2002, 2001, 1991, 1999, 2000, 1993, 1996, 1988, 2004, 1998, 1994,
       2003, 1997, 1983, 1979, 1995, 1982, 1985, 1992, 1986, 1978, 1980,
       1952, 1987, 1990, 1981, 1989, 1984, 0, 1968, 1961, 1958, 1974,
       1976, 1971, 1977, 1975, 1965, 1941, 1970, 1962, 1973, 1972, 1960,
       1966, 1920, 1956, 1959, 1953, 1951, 1942, 1963, 1964, 1969, 1954,
       1950, 1967, 2005, 1957, 1940, 1937, 1955, 1946, 1936, 1930, 2011,
       1925, 1948, 1943, 1947, 1945, 1923, 2020, 1939, 1926, 1938, 2030,
       1911, 1904, 1949, 1932, 1928, 1929, 1927, 1931, 1914, 2050, 1934,
       1910, 1933, 1902, 1924, 1921, 1900, 2038, 2026, 1944, 1917, 1901,
       2010, 1908, 1906, 1935, 1806, 2021, '2000', '1995', '1999', '2004',
       '2003', '1990', '1994', '1986', '1989', '2002', '1981', '1993',
       '1983', '1982', '1976', '1991', '1977', '1998', '1992', '1996',
       '0', '1997', '2001', '1974', '1968', '1987', '1984', '1988',
       '1963', '1956', '1970', '1985', '1978', '1973', '1980', '1979',
       '1975', '1969', '1961', '1965', '1939', '1958', '1950', '1953',
       '1966', '1971', '1959', '1972', '1955', '1957', '1945', '1960',
       '1967', '1932', '1924', '1964', '2012', '1911', '1927', '1948',
       '1962', '2006', '1952', '1940', '1951', '1931', '1954', '2005',
       '1930', '1941', '1944', '1943', '1938', '1900', '1942', '1923',
       '1920', '1933', '1909', '1946', '2008', '1378', '2030', '1936',
       '1947', '2011', '2020', '1919', '1949', '1922', '1897', '2024',
       '1376', '1926', '2037'], dtype=object)

### Change the datatype of yearOfPublication to 'int'

In [13]:
books["yearOfPublication"]=books["yearOfPublication"].astype(int)

In [14]:
books.dtypes

ISBN                 object
bookTitle            object
bookAuthor           object
yearOfPublication     int32
publisher            object
dtype: object

### Drop NaNs in `'publisher'` column

In [15]:
books.head(n=1)

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press

In [16]:
books["publisher"]=books["publisher"].dropna()

## Exploring Users dataset

In [17]:
print(users.shape)
users.head()

(278858, 3)

   userID                            Location   Age
0       1                  nyc, new york, usa   NaN
1       2           stockton, california, usa  18.0
2       3     moscow, yukon territory, russia   NaN
3       4           porto, v.n.gaia, portugal  17.0
4       5  farnborough, hants, united kingdom   NaN

### Get all unique values in ascending order for column `Age`

In [18]:
(users["Age"].sort_values()).unique()

array([  0.,   1.,   2.,   3.,   4.,   5.,   6.,   7.,   8.,   9.,  10.,
        11.,  12.,  13.,  14.,  15.,  16.,  17.,  18.,  19.,  20.,  21.,
        22.,  23.,  24.,  25.,  26.,  27.,  28.,  29.,  30.,  31.,  32.,
        33.,  34.,  35.,  36.,  37.,  38.,  39.,  40.,  41.,  42.,  43.,
        44.,  45.,  46.,  47.,  48.,  49.,  50.,  51.,  52.,  53.,  54.,
        55.,  56.,  57.,  58.,  59.,  60.,  61.,  62.,  63.,  64.,  65.,
        66.,  67.,  68.,  69.,  70.,  71.,  72.,  73.,  74.,  75.,  76.,
        77.,  78.,  79.,  80.,  81.,  82.,  83.,  84.,  85.,  86.,  87.,
        88.,  89.,  90.,  91.,  92.,  93.,  94.,  95.,  96.,  97.,  98.,
        99., 100., 101., 102., 103., 104., 105., 106., 107., 108., 109.,
       110., 111., 113., 114., 115., 116., 118., 119., 123., 124., 127.,
       128., 132., 133., 136., 137., 138., 140., 141., 143., 146., 147.,
       148., 151., 152., 156., 157., 159., 162., 168., 172., 175., 183.,
       186., 189., 199., 200., 201., 204., 207., 208., 209., 210., 212.,
       219., 220., 223., 226., 228., 229., 230., 231., 237., 239., 244.,
        nan])

Age column has some invalid entries like nan, 0 and very high values like 100 and above

### Values below 5 and above 90 do not make much sense for our book rating case...hence replace these by NaNs

In [19]:
import numpy as np
users['Age'] = users['Age'].apply(lambda x: np.nan if (x <5)|(x>90) else x)

In [20]:
users["Age"].unique()

array([nan, 18., 17., 61., 26., 14., 25., 19., 46., 55., 32., 24., 20.,
       34., 23., 51., 31., 21., 44., 30., 57., 43., 37., 41., 54., 42.,
       50., 39., 53., 47., 36., 28., 35., 13., 58., 49., 38., 45., 62.,
       63., 27., 33., 29., 66., 40., 15., 60., 79., 22., 16., 65., 59.,
       48., 72., 56., 67., 80., 52., 69., 71., 73., 78.,  9., 64., 12.,
       74., 75., 76., 83., 68., 11., 77., 70.,  8.,  7., 81., 10.,  5.,
        6., 84., 82., 90., 85., 86., 87., 89., 88.])

### Replace null values in column `Age` with mean

In [21]:
users.dtypes

userID        int64
Location     object
Age         float64
dtype: object

In [22]:
#mass_mean = inliers['mass'].mean(skipna=True)   # working with mean as the distribution is almost normal 
#print (mass_mean)

#data=data.replace({'mass': {0: mass_mean}})    # replace the 0 mass values in the original data with the mean of plasma
#print (data)

In [23]:
age_mean=users["Age"].mean()
age_mean

34.72384041634689

In [24]:
users['Age'] = users['Age'].fillna(age_mean)

In [25]:
users.head()

   userID                            Location       Age
0       1                  nyc, new york, usa  34.72384
1       2           stockton, california, usa  18.00000
2       3     moscow, yukon territory, russia  34.72384
3       4           porto, v.n.gaia, portugal  17.00000
4       5  farnborough, hants, united kingdom  34.72384

In [26]:
users.dtypes

userID        int64
Location     object
Age         float64
dtype: object

### Change the datatype of `Age` to `int`

In [27]:
print(sorted(users.Age.unique()))

[5.0, 6.0, 7.0, 8.0, 9.0, 10.0, 11.0, 12.0, 13.0, 14.0, 15.0, 16.0, 17.0, 18.0, 19.0, 20.0, 21.0, 22.0, 23.0, 24.0, 25.0, 26.0, 27.0, 28.0, 29.0, 30.0, 31.0, 32.0, 33.0, 34.0, 34.72384041634689, 35.0, 36.0, 37.0, 38.0, 39.0, 40.0, 41.0, 42.0, 43.0, 44.0, 45.0, 46.0, 47.0, 48.0, 49.0, 50.0, 51.0, 52.0, 53.0, 54.0, 55.0, 56.0, 57.0, 58.0, 59.0, 60.0, 61.0, 62.0, 63.0, 64.0, 65.0, 66.0, 67.0, 68.0, 69.0, 70.0, 71.0, 72.0, 73.0, 74.0, 75.0, 76.0, 77.0, 78.0, 79.0, 80.0, 81.0, 82.0, 83.0, 84.0, 85.0, 86.0, 87.0, 88.0, 89.0, 90.0]

## Exploring the Ratings Dataset

### check the shape

In [28]:
ratings.shape

(1149780, 3)

In [29]:
n_users = users.shape[0]
n_books = books.shape[0]

In [30]:
ratings.head(5)

   userID        ISBN  bookRating
0  276725  034545104X           0
1  276726  0155061224           5
2  276727  0446520802           0
3  276729  052165615X           3
4  276729  0521795028           6

### Ratings dataset should have books only which exist in our books dataset. Drop the remaining rows

In [40]:
ratings= pd.merge(books, ratings.drop_duplicates(['ISBN']), on="ISBN", how="left")

In [41]:
ratings.shape

(271357, 7)

### Ratings dataset should have ratings from users which exist in users dataset. Drop the remaining rows

In [43]:
users.head()

   userID                            Location       Age
0       1                  nyc, new york, usa  34.72384
1       2           stockton, california, usa  18.00000
2       3     moscow, yukon territory, russia  34.72384
3       4           porto, v.n.gaia, portugal  17.00000
4       5  farnborough, hants, united kingdom  34.72384

In [44]:
ratings= pd.merge(ratings, users.drop_duplicates(['userID']), on="userID", how="left")

### Consider only ratings from 1-10 and leave 0s in column `bookRating`

In [59]:
ratings.head()
ratings=ratings[ratings["bookRating"]!=0]
ratings.head()

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher,userID,bookRating,Location,Age
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,8.0,5.0,"timmins, ontario, canada",34.72384
9,074322678X,Where You'll Find Me: And Other Stories,Ann Beattie,2002,Scribner,8.0,5.0,"timmins, ontario, canada",34.72384
12,0887841740,The Middle Stories,Sheila Heti,2004,House of Anansi Press,8.0,5.0,"timmins, ontario, canada",34.72384
13,1552041778,Jane Doe,R. J. Kaiser,1999,Mira Books,8.0,5.0,"timmins, ontario, canada",34.72384
15,1567407781,The Witchfinder (Amos Walker Mystery Series),Loren D. Estleman,1998,Brilliance Audio - Trade,8.0,6.0,"timmins, ontario, canada",34.72384

### Find out which rating has been given highest number of times

In [57]:
ratings_grouped = ratings.groupby(['bookRating']).count()
ratings_grouped
#rating 8 has been given the maximum number of times

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher,userID,Location,Age
bookRating,,,,,,,,
1.0,508,508,508,508,508,508,508,508
2.0,665,665,665,665,665,665,665,665
3.0,1456,1456,1456,1456,1456,1456,1456,1456
4.0,2201,2201,2201,2201,2201,2201,2201,2201
5.0,14901,14901,14901,14901,14901,14901,14901,14901
6.0,8725,8725,8725,8725,8725,8725,8725,8725
7.0,17787,17787,17787,17787,17787,17787,17787,17787
8.0,23390,23390,23389,23390,23390,23390,23390,23390
9.0,15095,15095,15095,15095,15093,15095,15095,15095
10.0,20925,20925,20925,20925,20925,20925,20925,20925

### **Collaborative Filtering Based Recommendation Systems**

### For more accurate results only consider users who have rated atleast 100 books

In [65]:
ratings.head()
ratings1=ratings.groupby(["userID"]).agg({'bookRating': 'sum'})
ratings1

          bookRating
userID
8.0             39.0
12.0            10.0
14.0            11.0
17.0            15.0
19.0             7.0
22.0             7.0
32.0             8.0
39.0             8.0
42.0             7.0
53.0            28.0
56.0            16.0
64.0             7.0
67.0             7.0
70.0            10.0
73.0             5.0
78.0             8.0
81.0             5.0
82.0            10.0
83.0             7.0
85.0             5.0
86.0             4.0
87.0            16.0
88.0             7.0
92.0            25.0
97.0             7.0
99.0            50.0
102.0            7.0
107.0            8.0
109.0            5.0
110.0            6.0
...              ...
278713.0         8.0
278715.0         7.0
278720.0        12.0
278721.0         5.0
278724.0         8.0
278732.0        11.0
278750.0        10.0
278752.0         6.0
278759.0         1.0
278760.0         7.0
278772.0        10.0
278773.0        19.0
278777.0         5.0
278782.0        12.0
278786.0         6.0
278798.0         7.0
278800.0         9.0
278807.0        10.0
278818.0        19.0
278820.0         3.0
278824.0         6.0
278828.0         8.0
278831.0        10.0
278832.0        20.0
278843.0        67.0
278844.0        12.0
278846.0         8.0
278851.0        91.0
278852.0         8.0
278854.0        20.0

[24771 rows x 1 columns]

In [67]:
books_grouped = ratings.groupby(['userID']).agg({'bookRating': 'sum'}).reset_index()
grouped_sum = books_grouped['bookRating'].sum()
books_grouped['percentage']  = books_grouped['bookRating'].div(grouped_sum)*100
books_grouped.sort_values(['bookRating', 'userID'], ascending = [0,1])

         userID  bookRating  percentage
2014    11676.0     31135.0    3.898703
11717   98391.0     25493.0    3.192215
18747  189835.0      6798.0    0.851241
3641    23902.0      6761.0    0.846608
7553    56399.0      6043.0    0.756700
9621    76499.0      5759.0    0.721138
16138  153662.0      4669.0    0.584649
8319    63714.0      4012.0    0.502380
12022  101851.0      3357.0    0.420361
2712    16795.0      3241.0    0.405836
22580  248718.0      2985.0    0.373780
19290  197659.0      2871.0    0.359505
17389  171118.0      2676.0    0.335087
3638    23872.0      2543.0    0.318433
18705  189334.0      2346.0    0.293764
5243    35859.0      2269.0    0.284123
4742    31826.0      2171.0    0.271851
7610    56959.0      2096.0    0.262460
9634    76626.0      1942.0    0.243176
10813   88733.0      1899.0    0.237791
8885    69078.0      1881.0    0.235537
843      4385.0      1791.0    0.224268
2685    16634.0      1613.0    0.201979
10664   87141.0      1562.0    0.195593
11211   93047.0      1557.0    0.194966
23429  262998.0      1529.0    0.191460
7029    51883.0      1503.0    0.188205
9913    79441.0      1477.0    0.184949
18428  185233.0      1374.0    0.172051
14247  129074.0      1356.0    0.169797
...         ...         ...         ...
19059  194496.0         1.0    0.000125
19271  197392.0         1.0    0.000125
19655  203401.0         1.0    0.000125
19753  204823.0         1.0    0.000125
19878  206650.0         1.0    0.000125
19936  207405.0         1.0    0.000125
20208  211493.0         1.0    0.000125
21001  223595.0         1.0    0.000125
21211  226559.0         1.0    0.000125
21300  228268.0         1.0    0.000125
21462  230855.0         1.0    0.000125
21508  231639.0         1.0    0.000125
21567  232673.0         1.0    0.000125
21767  235987.0         1.0    0.000125
21905  238300.0         1.0    0.000125
22024  239908.0         1.0    0.000125
22284  244422.0         1.0    0.000125
22489  247582.0         1.0    0.000125
22987  254648.0         1.0    0.000125
23040  255493.0         1.0    0.000125
23413  262664.0         1.0    0.000125
23715  267559.0         1.0    0.000125
23801  269052.0         1.0    0.000125
23868  269946.0         1.0    0.000125
24065  273397.0         1.0    0.000125
24085  273886.0         1.0    0.000125
24110  274186.0         1.0    0.000125
24586  278024.0         1.0    0.000125
24707  278540.0         1.0    0.000125
24749  278759.0         1.0    0.000125

[24771 rows x 3 columns]

In [73]:
users=books_grouped[books_grouped["bookRating"]>100]
users.head()

     userID  bookRating  percentage
48    242.0       193.0    0.024167
52    254.0       331.0    0.041448
75    388.0       104.0    0.013023
103   503.0       124.0    0.015527
105   507.0       239.0    0.029927

### Generating ratings matrix from explicit ratings

#### Note: since NaNs cannot be handled by training algorithms, replace these by 0, which indicates absence of ratings

In [75]:
users=users.replace(np.nan,0)

### Generate the predicted ratings using SVD with no.of singular values to be 50

In [81]:
ratings.head()

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher,userID,bookRating,Location,Age
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,8.0,5.0,"timmins, ontario, canada",34.72384
9,074322678X,Where You'll Find Me: And Other Stories,Ann Beattie,2002,Scribner,8.0,5.0,"timmins, ontario, canada",34.72384
12,0887841740,The Middle Stories,Sheila Heti,2004,House of Anansi Press,8.0,5.0,"timmins, ontario, canada",34.72384
13,1552041778,Jane Doe,R. J. Kaiser,1999,Mira Books,8.0,5.0,"timmins, ontario, canada",34.72384
15,1567407781,The Witchfinder (Amos Walker Mystery Series),Loren D. Estleman,1998,Brilliance Audio - Trade,8.0,6.0,"timmins, ontario, canada",34.72384

In [80]:

R_df = ratings.pivot(index = 'userID', columns ='ISBN', values = 'bookRating')
R_df.tail()

ValueError: negative dimensions are not allowed

### Take a particular user_id

### Lets find the recommendations for user with id `2110`

#### Note: Execute the below cells to get the variables loaded

In [31]:
userID = 2110

In [32]:
user_id = 2 #2nd row in ratings matrix and predicted matrix

### Get the predicted ratings for userID `2110` and sort them in descending order

### Create a dataframe with name `user_data` containing userID `2110` explicitly interacted books

In [33]:
user_data.head()

NameError: name 'user_data' is not defined

In [ ]:
user_data.shape

### Combine the user_data and and corresponding book data(`book_data`) in a single dataframe with name `user_full_info`

In [ ]:
book_data.shape

In [ ]:
book_data.head()

In [ ]:
user_full_info.head()

### Get top 10 recommendations for above given userID from the books not already rated by that user